echo ==============================================================================
echo =============================== DNF UPDATE ===================================
echo ==============================================================================

sudo dnf -y update

echo ""
echo ""
echo ==============================================================================
echo ======================== DNF INSTALL DEPEDENCIES =============================
echo ==============================================================================
echo ""

sudo dnf -y groupinstall 'Development Tools'

sudo mkdir -p /opt/ogon/lib

#/opt/ogon/misc используется при разворачивании ogon 
sudo mkdir -p /opt/ogon/misc

sudo chown ${USER}:${USER} -R /opt/ogon
